CREATE TABLE IF NOT EXISTS  users (
    user_id SERIAL PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    age SMALLINT,
    birthdate DATE,
    phone VARCHAR(15)
);

INSERT INTO users (name, age, birthdate, phone) VALUES
    ('Алексей Иванов', 25, '1999-05-15', '+79001112233'),
    ('Мария Петрова', 30, '1994-08-22', '+79004445566'),
    ('Дмитрий Соколов', 22, '2002-01-10', '+79007778899'),
    ('Анна Кузнецова', 28, '1996-11-30', '+79001234567'),
    ('Игорь Смирнов', 35, '1989-03-12', '+79009876543'),
    ('Елена Попова', 27, '1997-07-05', '+79005554433'),
    ('Сергей Васильев', 40, '1984-12-20', '+79002223344'),
    ('Ольга Новикова', 24, '2001-09-14', '+79006667788'),
    ('Виктор Федоров', 31, '1993-02-28', '+79003332211'),
    ('Наталья Морозова', 29, '1995-06-18', '+79008889900');

SELECT * FROM users;

--  user_id |       name       | age | birthdate  |    phone
-- ---------+------------------+-----+------------+--------------
--        1 | Алексей Иванов   |  25 | 1999-05-15 | +79001112233
--        2 | Мария Петрова    |  30 | 1994-08-22 | +79004445566
--        3 | Дмитрий Соколов  |  22 | 2002-01-10 | +79007778899
--        4 | Анна Кузнецова   |  28 | 1996-11-30 | +79001234567
--        5 | Игорь Смирнов    |  35 | 1989-03-12 | +79009876543
--        6 | Елена Попова     |  27 | 1997-07-05 | +79005554433
--        7 | Сергей Васильев  |  40 | 1984-12-20 | +79002223344
--        8 | Ольга Новикова   |  24 | 2001-09-14 | +79006667788
--        9 | Виктор Федоров   |  31 | 1993-02-28 | +79003332211
--       10 | Наталья Морозова |  29 | 1995-06-18 | +79008889900
